<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>2016年终小结 | teresa Ruan</title><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/normalize/4.2.0/normalize.min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/pure-min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.6.3/css/font-awesome.min.css"><script type="text/javascript" src="//cdn.bootcss.com/jquery/3.0.0/jquery.min.js"></script><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">2016年终小结</h1><a id="logo" href="/.">teresa Ruan</a><p class="description">生活小记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">2016年终小结</h1><div class="post-meta">Dec 27, 2016<script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><div class="post-content"><p>&#x2003;&#x2003;&#x4ECA;&#x5929;&#xFF0C;2016&#x5E74;12&#x6708;27&#x53F7;&#xFF0C;16&#x5E74;&#x5373;&#x5C06;&#x8FC7;&#x53BB;&#xFF0C;&#x6211;&#x771F;&#x6B63;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x5927;&#x5B66;&#x751F;&#x6D3B;&#x4E5F;&#x5373;&#x5C06;&#x7ED3;&#x675F;&#xFF0C;<br>&#x60F3;&#x5199;&#x70B9;&#x6587;&#x5B57;&#x56DE;&#x987E;&#x4E0B;&#x8FD9;&#x4E00;&#x5E74;&#xFF0C;&#x65E0;&#x5173;&#x5176;&#x5B83;&#xFF0C;&#x53EA;&#x662F;&#x505A;&#x4E00;&#x4E2A;&#x68B3;&#x7406;&#x548C;&#x8BB0;&#x5F55;&#x5427;&#x3002;&#x8BB0;&#x5F97;&#x597D;&#x50CF;&#x4ECE;&#x9AD8;&#x4E2D;&#x6BD5;&#x4E1A;&#x4EE5;&#x6765;&#x5C31;&#x518D;&#x4E5F;&#x6CA1;<br>&#x5199;&#x8FC7;&#x4EC0;&#x4E48;&#x6587;&#x7AE0;&#xFF0C;&#x73B0;&#x5728;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5F53;&#x65F6;&#x5BF9;&#x4E8E;&#x4E0D;&#x7528;&#x518D;&#x5199;&#x90A3;&#x51E0;&#x767E;&#x5B57;&#x7684;&#x5C0F;&#x4F5C;&#x6587;&#x7684;&#x5FC3;&#x60C5;&#x662F;&#x7A83;&#x559C;&#x7684;&#x3002;<br>&#x2003;&#x2003;16&#x5E74;&#x7684;&#x6211;&#x5927;&#x56DB;&#x4E86;&#xFF0C;&#x5728;&#x8FD9;&#x5B66;&#x671F;&#x7684;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x5C31;&#x5F00;&#x59CB;&#x5FD9;&#x788C;&#x4E8E;&#x627E;&#x5DE5;&#x4F5C;&#x3002;10&#x6708;&#x7684;&#x65F6;&#x5019;&#x7EC8;&#x662F;&#x53C2;&#x52A0;&#x4E86;&#x9762;&#x8BD5;&#xFF0C;&#x5E76;&#x4E14;&#x8FDB;&#x5165;&#x4E86;&#x73B0;&#x5728;&#x7684;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;<br>&#x521A;&#x5165;&#x804C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x662F;&#x5FD0;&#x5FD1;&#x7684;&#xFF0C;&#x6211;&#x60F3;&#x5F53;&#x65F6;&#x662F;&#x6E90;&#x4E8E;&#x5BF9;&#x81EA;&#x5DF1;&#x80FD;&#x529B;&#x7684;&#x4E0D;&#x81EA;&#x4FE1;&#x5427;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4F1A;&#x7ED9;&#x81EA;&#x5DF1;&#x704C;&#x9E21;&#x6C64;&#xFF0C;&#x6211;&#x4F1A;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#xFF0C;&#x4F60;&#x4E0D;&#x591F;&#x7279;&#x522B;&#xFF0C;&#x4E0D;&#x591F;&#x4F18;&#x79C0;&#xFF0C;&#x4F60;&#x80FD;&#x505A;&#x7684;&#x5C31;&#x662F;&#x52AA;&#x529B;&#x4E00;&#x70B9;&#x66F4;&#x52A0;&#x52AA;&#x529B;&#x4E00;&#x70B9;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5B9E;&#x4E60;&#x751F;&#xFF0C;&#x6211;&#x60F3;&#x6211;&#x9700;&#x8981;&#x505A;&#x7684;&#x6700;&#x7EC8;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x8C26;&#x900A;&#x597D;&#x5B66;&#x6562;&#x95EE;&#x3002;  </p>
<h3 id="&#x5173;&#x4E8E;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;"><a href="#&#x5173;&#x4E8E;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;" class="headerlink" title="&#x5173;&#x4E8E;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;"></a>&#x5173;&#x4E8E;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;</h3><p>&#x2003;&#x2003;&#x5927;&#x56DB;&#x4E0D;&#x514D;&#x8981;&#x5F00;&#x59CB;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;&#x7684;&#x5236;&#x4F5C;&#xFF0C;&#x6211;&#x7684;&#x6BD5;&#x8BBE;&#x524D;&#x7AEF;&#x7528;&#x7684;&#x662F;react&#x548C;redux&#xFF0C;&#x540E;&#x7AEF;&#x7528;&#x7684;&#x662F;node&#x548C;mongodb&#x3002;&#x5F53;&#x65F6;&#x597D;&#x50CF;&#x4E5F;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x81EA;&#x5DF1;&#x80FD;&#x591F;&#x5B66;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x8FDB;&#x884C;&#x4F7F;&#x7528;&#xFF0C;&#x624D;&#x4EE5;&#x6BD5;&#x8BBE;&#x7684;&#x5F62;&#x5F0F;&#x5F3A;&#x5236;&#x81EA;&#x5DF1;&#x53BB;&#x5E94;&#x7528;&#x3002;&#x5728;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x4E0E;&#x56F0;&#x96BE;&#xFF0C;&#x76F4;&#x5230;&#x73B0;&#x5728;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x5730;&#x65B9;&#x6211;&#x53EA;&#x662F;&#x8FDB;&#x884C;&#x4E86;&#x89E3;&#x51B3;&#x5374;&#x5E76;&#x6CA1;&#x6709;&#x6DF1;&#x7A76;&#x671F;&#x95F4;&#x7684;&#x6DF1;&#x610F;&#x3002;<br>&#x2003;&#x2003;&#x4ED4;&#x7EC6;&#x5730;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x8DEF;&#x7EBF;&#xFF0C;&#x4F3C;&#x4E4E;&#x90FD;&#x662F;&#x4EC5;&#x4EC5;&#x6D6E;&#x5728;&#x8868;&#x9762;&#x4E0A;&#x7684;API&#x5B66;&#x4E60;&#x548C;&#x5E94;&#x7528;&#xFF0C;&#x5BF9;&#x4E8E;&#x771F;&#x6B63;&#x7684;&#x601D;&#x60F3;&#x5C42;&#x9762;&#x4E0A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6CA1;&#x6709;&#x4ED4;&#x7EC6;&#x53BB;&#x60F3;&#x8FC7;&#x53BB;&#x7814;&#x7A76;&#x8FC7;&#xFF0C;&#x76F2;&#x76EE;&#x5730;&#x8FFD;&#x6C42;&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x7684;&#x65B0;&#x6280;&#x672F;&#xFF0C;&#x5374;&#x4EC5;&#x4EC5;&#x505C;&#x7559;&#x5728;&#x7528;&#x7684;&#x5C42;&#x9762;&#x4E0A;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x770B;&#x5230;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4E0A;&#x8BF4;17&#x5E74;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x4F1A;&#x88AB;&#x5E9F;&#x5F03;&#x6389;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x96BE;&#x514D;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x6050;&#x614C;&#xFF0C;&#x611F;&#x89C9;&#x629B;&#x5F03;&#x90A3;&#x4E9B;API&#x81EA;&#x5DF1;&#x786E;&#x5B9E;&#x662F;&#x6CA1;&#x6709;&#x5B66;&#x5230;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x3002;&#x7A81;&#x7136;&#x4E5F;&#x662F;&#x60F3;&#x8D77;&#x4E86;&#x6749;&#x672C;&#x535A;&#x53F8;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;  </p>
<blockquote>
<p>&#x6211;&#x4EE5;&#x4E3A;&#x771F;&#x6B63;&#x7684;&#x7F8E;&#x4E3D;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x65F6;&#x95F4;&#x8003;&#x9A8C;&#x7684;&#x4E1C;&#x897F;&#x3002;<br>&#x65F6;&#x95F4;&#xFF0C;&#x6709;&#x7740;&#x538B;&#x8FEB;&#x3001;&#x4E0D;&#x8D66;&#x514D;&#x4EFB;&#x4F55;&#x4EBA;&#x7684;&#x8150;&#x8680;&#x529B;&#x91CF;&#xFF0C;<br>&#x4EE5;&#x53CA;&#x5C06;&#x6240;&#x6709;&#x4E8B;&#x7269;<br>&#x5F52;&#x8FD8;&#x571F;&#x5730;&#x7684;&#x7684;&#x610F;&#x5FD7;&#x3002;<br>&#x80FD;&#x591F;&#x5FCD;&#x53D7;&#x8FD9;&#x4E9B;<br>&#x800C;&#x7559;&#x5B58;&#x4E0B;&#x6765;&#x7684;&#x5F62;&#x4E0E;&#x8272;&#xFF0C;<br>&#x624D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x7F8E;&#x4E3D;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x6211;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5F0F;&#x786E;&#x5B9E;&#x662F;&#x9700;&#x8981;&#x6539;&#x53D8;&#x7684;&#xFF01;  </p>
<h3 id="&#x5173;&#x4E8E;&#x4E2A;&#x4EBA;&#x53D1;&#x5C55;&#x65B9;&#x5411;"><a href="#&#x5173;&#x4E8E;&#x4E2A;&#x4EBA;&#x53D1;&#x5C55;&#x65B9;&#x5411;" class="headerlink" title="&#x5173;&#x4E8E;&#x4E2A;&#x4EBA;&#x53D1;&#x5C55;&#x65B9;&#x5411;"></a>&#x5173;&#x4E8E;&#x4E2A;&#x4EBA;&#x53D1;&#x5C55;&#x65B9;&#x5411;</h3><p>&#x2003;&#x2003;&#x4EBA;&#x5728;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#x96BE;&#x514D;&#x4F1A;&#x60F3;&#x5F88;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x60F3;&#x81EA;&#x5DF1;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x60F3;&#x5BB6;&#x4E2D;&#x7684;&#x7236;&#x6BCD;&#x3002;&#x4ECA;&#x5929;&#x4E0B;&#x73ED;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x5E94;&#x8BE5;&#x7ED9;&#x81EA;&#x5DF1;&#x4EE5;&#x540E;&#x53D1;&#x5C55;&#x7684;&#x5927;&#x65B9;&#x5411;&#x505A;&#x4E00;&#x4E2A;&#x89C4;&#x5212;&#xFF0C;&#x5F53;&#x7136;&#x6574;&#x4F53;&#x4E0A;&#x6211;&#x4F1A;&#x7EE7;&#x7EED;&#x505A;&#x524D;&#x7AEF;&#xFF0C;&#x4F46;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x5E94;&#x8BE5;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5728;&#x524D;&#x7AEF;&#x7684;&#x6BCF;&#x4E2A;&#x5206;&#x652F;&#x4E0A;&#x90FD;&#x505A;&#x5230;&#x5DEE;&#x5F3A;&#x4EBA;&#x610F;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x8D77;&#x7801;&#x662F;17&#x5E74;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x592A;&#x4EE5;&#x540E;&#x7684;&#x4E8B;&#x60C5;&#x8C01;&#x77E5;&#x9053;&#x5462;&#x3002;<br>&#x2003;&#x2003;&#x4ECE;&#x521A;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x5230;webgl&#x7684;&#x65F6;&#x5019;&#x6211;&#x89C9;&#x5F97;&#x4ED6;&#x5F88;&#x662F;&#x9177;&#x70AB;&#xFF0C;&#x73B0;&#x5728;&#x8FD9;&#x4EFD;&#x5FC3;&#x60C5;&#x867D;&#x7136;&#x6DE1;&#x4E86;&#x4E0D;&#x5C11;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x5411;&#xFF0C;&#x4E0D;&#x662F;&#x5417;&#xFF1F;17&#x5E74;&#x6211;&#x4E5F;&#x60F3;&#x4ECE;&#x8BBE;&#x8BA1;&#x5EFA;&#x6A21;&#x5230;&#x5B9E;&#x73B0;&#xFF0C;&#x81EA;&#x5DF1;&#x505A;&#x4E00;&#x4E2A;webgl&#x5C0F;&#x6E38;&#x620F;&#x3002;&#xFF08;&#x4E00;&#x5B9A;&#x8981;&#x8BF4;&#x5230;&#x5C31;&#x505A;&#x5440;&#xFF01;&#xFF09;  </p>
<h3 id="&#x5173;&#x4E8E;&#x6BD5;&#x4E1A;"><a href="#&#x5173;&#x4E8E;&#x6BD5;&#x4E1A;" class="headerlink" title="&#x5173;&#x4E8E;&#x6BD5;&#x4E1A;"></a>&#x5173;&#x4E8E;&#x6BD5;&#x4E1A;</h3><p>&#x2003;&#x2003;&#x6BD5;&#x7ADF;&#x5DF2;&#x7ECF;&#x5927;&#x56DB;&#x4E86;&#xFF0C;&#x79BB;&#x6BD5;&#x4E1A;&#x4E5F;&#x5C31;&#x662F;&#x90A3;&#x4E48;&#x4E00;&#x77AC;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x5BF9;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5149;&#x5012;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x7684;&#x6000;&#x5FF5;&#xFF0C;&#x6CA1;&#x6709;&#x540E;&#x6094;&#x548C;&#x9057;&#x61BE;&#x3002;&#x6211;&#x6700;&#x6700;&#x60F3;&#x5FF5;&#x7684;&#x8FD8;&#x662F;&#x9AD8;&#x4E09;&#x7684;&#x90A3;&#x6BB5;&#x65F6;&#x5149;&#xFF0C;&#x548C;&#x90A3;&#x7FA4;&#x670B;&#x53CB;&#x4E00;&#x8D77;&#x4E0A;&#x8BFE;&#x6253;&#x724C;&#x7684;&#x65E5;&#x5B50;&#xFF08;&#x5F53;&#x7136;&#x8FD9;&#x662F;&#x4E0D;&#x597D;&#x7684;&#xFF09;&#xFF0C;&#x4E00;&#x8D77;&#x722C;&#x5899;&#x7FD8;&#x8BFE;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x867D;&#x7136;&#x6700;&#x540E;&#x8086;&#x610F;&#x4E86;&#x9752;&#x6625;&#x8352;&#x5E9F;&#x4E86;&#x5B66;&#x4E1A;&#xFF0C;&#x4F46;&#x662F;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x8FC7;&#x7684;&#x5F88;&#x771F;&#x5207;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x6D3B;&#x7684;&#x6700;&#x968F;&#x610F;&#x7684;&#x4E00;&#x6BB5;&#x65E5;&#x5B50;&#x5427;&#x3002;<br>&#x2003;&#x2003;&#x5176;&#x5B9E;&#x540E;&#x6765;&#x9AD8;&#x8003;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x6211;&#x95EE;&#x8FC7;&#x81EA;&#x5DF1;&#xFF0C;&#x4E0D;&#x60F3;&#x4E0A;&#x597D;&#x5927;&#x5B66;&#x5417;&#xFF0C;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x7684;&#xFF0C;&#x6211;&#x66FE;&#x7ECF;&#x4E5F;&#x662F;&#x6709;&#x8FC7;&#x540D;&#x6821;&#x68A6;&#x7684;&#x5973;&#x5B69;&#x5B50;&#xFF08;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x76F4;&#x5230;&#x73B0;&#x5728;&#x8FD8;&#x662F;&#x6709;&#xFF0C;&#x4F46;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x5706;&#x8FD9;&#x4E2A;&#x68A6;&#x4E86;&#xFF09;&#x3002;&#x6211;&#x662F;&#x6015;&#x52AA;&#x529B;&#x8FC7;&#x540E;&#x7684;&#x5931;&#x843D;&#x611F;&#xFF0C;&#x6015;&#x73B0;&#x5B9E;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x5426;&#x5B9A;&#x3002;<br>&#x73B0;&#x5728;&#x8981;&#x6BD5;&#x4E1A;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x5F88;&#x4E0D;&#x820D;&#x7684;&#xFF0C;&#x60F3;&#x7EE7;&#x7EED;&#x8BFB;&#x4E66;&#xFF0C;&#x633A;&#x7FA1;&#x6155;&#x4ED6;&#x4EEC;&#x8003;&#x7814;&#x7684;&#x540C;&#x5B66;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x5916;&#x529B;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x5C31;&#x4E1A;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x8BB8;&#x6211;&#x4E5F;&#x4F1A;&#x5728;&#x5C06;&#x6765;&#x7684;&#x7684;&#x67D0;&#x4E00;&#x5929;&#x62FF;&#x8D77;&#x8BFE;&#x672C;&#x91CD;&#x65B0;&#x8FDB;&#x5165;&#x6821;&#x56ED;&#xFF0C;&#x542C;&#x8001;&#x5E08;&#x5728;&#x8BB2;&#x53F0;&#x4E0A;&#x7684;&#x6388;&#x4E1A;&#xFF0C;&#x90A3;&#x65F6;&#x7684;&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x5206;&#x5916;&#x5730;&#x73CD;&#x60DC;&#x3002;</p>
<h3 id="&#x5173;&#x4E8E;2017"><a href="#&#x5173;&#x4E8E;2017" class="headerlink" title="&#x5173;&#x4E8E;2017"></a>&#x5173;&#x4E8E;2017</h3><p>&#x5FE0;&#x4E8E;&#x81EA;&#x5DF1;<br>&#x65E0;&#x6094;&#x4E8E;&#x9752;&#x6625;  </p>
</div><script type="text/javascript" src="/js/share.js?v=0.0.0" async></script><a data-url="https://teresaruan.github.io/2016/12/27/2016person/" data-id="cix8zb88l0000ugd5401isn1d" class="article-share-link">分享到</a><div class="tags"></div><div class="post-nav"><a href="/2016/12/25/mobile/" class="next">移动端开发所遇问题小结</a></div></div></div></div><div class="pure-u-1-4 hidden_mid_and_down"><div id="sidebar"><div class="widget"><div class="search-form"><input id="local-search-input" placeholder="Search" type="text" name="q" results="0"/><div id="local-search-result"></div></div></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/12/27/2016person/">2016年终小结</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/12/25/mobile/">移动端开发所遇问题小结</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/10/13/summarize2/">总结（二）：js事件代理（委托）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/10/12/js1/">总结（一）：javascript闭包（作用域链、垃圾回收机制）</a></li></ul></div></div></div><div class="pure-u-1 pure-u-md-3-4"><div id="footer">© <a href="/." rel="nofollow">teresa Ruan.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div></div></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/totop.js?v=0.0.0" async></script><script type="text/javascript" src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js" async></script><script type="text/javascript" src="/js/fancybox.js?v=0.0.0" async></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script type="text/javascript" src="/js/search.js?v=0.0.0"></script><script>var search_path = 'search.xml';
if (search_path.length == 0) {
   search_path = 'search.xml';
}
var path = '/' + search_path;
searchFunc(path, 'local-search-input', 'local-search-result');
</script><script>var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?e.g. 8006843039519956000";
  var s = document.getElementsByTagName("script")[0];
  s.parentNode.insertBefore(hm, s);
  })();
</script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>